# <font color='purple'>Natnicha Palakawong na ayuthaya

# <font color='orange'>Human Resources and Candidate Search

## Data sources

I gathered 15 resumes; some of them are from the website called monster.com, some of them are from my friends, and I created some of the resume myself. I found the job description online from linkedin.com; Amazon company is looking for machine learning scientist.

First, I import all the library that will be needed for this assignment.

In [1]:
import numpy as np
import pandas as pd
import re
import sys
import csv

## Data Cleaning

First, I open and read Candidates.csv file to see what is in the file.

In [2]:
with open('Candidates.csv','r') as candidates_file:
    candidates_array = csv.reader(candidates_file)
    for row in candidates_array:
        ## Join by comma
        print(', '.join(row))

Filetype: CSV,
, Information about candidates
, Candidates for the new Data Scientist role
Name, Name of the text file
THOMAS B. SEEKER, Thomas_resume
JOSH K. SCOTT, Josh_resume
SVETLANA KON, Kon_resume
PURSA TANEEPAN, Pursa_resume
IGOR KORICANAC, Igor_resume
IGOR KORICANAC, Igor_resume
PAT SRISITTIDECH , Pat_resume
MARIA TANNER, Maria_resume
GRACE PINKERTON, Grace_resume
AMY JONES, Amy_resume
AMY JONES, Amy_resume
DAPHNE WRIGHT, Daphne_resume
CATHERINE DRUMMOND, Cat_resume
MARIE ANDERSON, Marie_resume
DANA LOWELL, Dana_resume
PEYTON A. GARRETT, Peyton_resume
CARLA FOSTER, Carla_resume
PHOEBE ENDSLEY,
PENNY SMITH,

I found that the 3 header rows can be skipped because they are not useful for my analysis in this project.

I skip the first three rows and read the file.

In [3]:
df = pd.read_csv("Candidates.csv", skiprows = 3)
df

                  Name Name of the text file
0     THOMAS B. SEEKER         Thomas_resume
1        JOSH K. SCOTT           Josh_resume
2         SVETLANA KON            Kon_resume
3       PURSA TANEEPAN          Pursa_resume
4       IGOR KORICANAC           Igor_resume
5       IGOR KORICANAC           Igor_resume
6    PAT SRISITTIDECH             Pat_resume
7         MARIA TANNER          Maria_resume
8      GRACE PINKERTON          Grace_resume
9            AMY JONES            Amy_resume
10           AMY JONES            Amy_resume
11       DAPHNE WRIGHT         Daphne_resume
12  CATHERINE DRUMMOND            Cat_resume
13      MARIE ANDERSON          Marie_resume
14         DANA LOWELL           Dana_resume
15   PEYTON A. GARRETT         Peyton_resume
16        CARLA FOSTER          Carla_resume
17      PHOEBE ENDSLEY                   NaN
18         PENNY SMITH                   NaN

There are duplicate values and empty values in my dataframe. Therefore, I have to continue cleaning up my data.

Count total rows in dataframe

In [4]:
len(df)

19

Next, I drop the duplicate rows.

In [5]:
df = df.drop_duplicates()
df

                  Name Name of the text file
0     THOMAS B. SEEKER         Thomas_resume
1        JOSH K. SCOTT           Josh_resume
2         SVETLANA KON            Kon_resume
3       PURSA TANEEPAN          Pursa_resume
4       IGOR KORICANAC           Igor_resume
6    PAT SRISITTIDECH             Pat_resume
7         MARIA TANNER          Maria_resume
8      GRACE PINKERTON          Grace_resume
9            AMY JONES            Amy_resume
11       DAPHNE WRIGHT         Daphne_resume
12  CATHERINE DRUMMOND            Cat_resume
13      MARIE ANDERSON          Marie_resume
14         DANA LOWELL           Dana_resume
15   PEYTON A. GARRETT         Peyton_resume
16        CARLA FOSTER          Carla_resume
17      PHOEBE ENDSLEY                   NaN
18         PENNY SMITH                   NaN

Count total rows in dataframe

In [6]:
len(df)

17

Then, I remove NaN values from dataframe

In [7]:
df = df.dropna()
df

                  Name Name of the text file
0     THOMAS B. SEEKER         Thomas_resume
1        JOSH K. SCOTT           Josh_resume
2         SVETLANA KON            Kon_resume
3       PURSA TANEEPAN          Pursa_resume
4       IGOR KORICANAC           Igor_resume
6    PAT SRISITTIDECH             Pat_resume
7         MARIA TANNER          Maria_resume
8      GRACE PINKERTON          Grace_resume
9            AMY JONES            Amy_resume
11       DAPHNE WRIGHT         Daphne_resume
12  CATHERINE DRUMMOND            Cat_resume
13      MARIE ANDERSON          Marie_resume
14         DANA LOWELL           Dana_resume
15   PEYTON A. GARRETT         Peyton_resume
16        CARLA FOSTER          Carla_resume

Count total rows in dataframe

In [8]:
len(df)

15

After I clean the data, the total number of the candidates is 15. Now we have 15 resumes in our system.

## Job Description

First, I open and read the Job_description.txt file

In [9]:
with open ("Job_description.txt", "r") as jd:
    for line in jd:
        print(line, end = "")

Job Description
This role offers a unique opportunity to innovate and improve PayPal’s Data Science capabilities for Global Customer Operations.
PayPal’s Global Data Sciences team is responsible for developing and enhancing machine learning and data mining capabilities, which are key in PayPal’s top-of-the-line data-driven decisions. We are a group of data scientists and problem solvers with strong analytical, mathematical, and programming skills and like to approach various kinds of challenges in complex environments. This role offers a unique opportunity to innovate and improve PayPal’s Data Science capabilities for Global Customer Operations, such as NLP and chatbot.
Design, develop and implement advanced predictive models using advanced data mining and machine learning techniques
Collaborate with other data scientists and engineers to formulate innovative solutions to experiment and implement advanced data mining techniques
Work with large volumes of data; extract and manipulate large datasets using standard tools such as Python, Hadoop, R, SQL and SAS
Analyze data covering a wide range of information from user profile to transaction history. Identify new customer behavior patterns through data mining
Communicate complex concepts and the results of the analyses in a clear and effective manner through creative visualization
Qualification
Advanced degree (MS or PhD) in science or engineering field. Level will be determined based on experience.
Expertise developing natural language processing/understanding algorithms/models required.
Expertise applying deep learning techniques to NLP/U problems required including thorough knowledge of the theory and practice of NLP and deep learning techniques.
Data Mining experience in Python, R, H2O, Scala and/or other Big Data techniques. Familiar with various Machine Learning algorithms and Statistical methods
Skilled with Java, C++, or other programming language, as well as with R, MATLAB, Python or similar scripting language;
Ability to deal with a large amount of data and fluency with SQL or SQL-like tools
Strong problem solving and communication skills
Passion in working on big data and professional experience in data mining, statistical analysis, predictive modeling, NLP, and data manipulation
Data Science experience in Customer Services is a strong plus
Skills required
Data mining
Statistical analysis
Predictive modeling
Data manipulation
Machine learning
NLP
UNIX
Python
JAVA
C++
Hadoop
R
MATLAB
SQL
SAS
SQL
H2O
Big data

Next, I want to extract a list of skills required from job description to gather the required skills.

In order to gain the required skills from job description, I open the file and print all the lines in a file after a pattern 'Skills required'.

In [10]:
with open("Job_description.txt", "r") as f:
    while 'Skills required' not in f.readline():
        continue
    print(f.read().split('\n'))

['Data mining', 'Statistical analysis', 'Predictive modeling', 'Data manipulation', 'Machine learning', 'NLP', 'UNIX', 'Python', 'JAVA', 'C++', 'Hadoop', 'R', 'MATLAB', 'SQL', 'SAS', 'SQL', 'H2O', 'Big data']

Now I have a list of all the skills required that are in the job description file.

## Skill matching

I try this out by matching skills in Thomas's resume with skills from job description and count the number of matches.

In [13]:
with open("Thomas_resume.txt", "r", encoding="utf8") as fd:
    # Turn everthing into lower case 
    l = fd.read().lower()
    # Use regular expression to match skills with candidates
    match = re.findall('sql|unix|c\+\+',l)
    # Count the total matched skills for each candidate
    #print (set(match))
    print("There are " + str(len(set(match))) + " skills matched in Thomas's resume.")

There are 3 skills matched in Thomas's resume.

Now my code is ready to apply for all the candidates.

I loop through the Candidates.csv file to identify candidates who fit for the role (exact fit for skill matching) by counting number of matching skills that appear in their resume.

In [130]:
resume_file = df["Name of the text file"] + ".txt"
score = []
for element in resume_file:
    with open(element, "r", encoding="utf8") as fd:
        # Turn everthing into lower case 
        l = fd.read().lower()
        # Use regular expression to match skills with candidates
        match = re.findall('sql|unix|c\+\+|sas|r|java|data mining|statistical analysis|big data',l)
        # Count the total matched skills for each candidate
        ## print(len(set(match))) 
        score.append(len(set(match)))

Below score is the number of skill matching in each candidate resume.

In [131]:
score

[4, 5, 2, 1, 1, 1, 6, 6, 4, 1, 5, 2, 6, 2, 1]

I create a dataframe that contains information about each candidate (Name ,Name of the resume file, and skill matching score)

In [132]:
c_score = df
c_score["Matched skill"] = score
c_score

/Users/natnicha/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

                  Name Name of the text file  Matched skill
0     THOMAS B. SEEKER         Thomas_resume              4
1        JOSH K. SCOTT           Josh_resume              5
2         SVETLANA KON            Kon_resume              2
3       PURSA TANEEPAN          Pursa_resume              1
4       IGOR KORICANAC           Igor_resume              1
6    PAT SRISITTIDECH             Pat_resume              1
7         MARIA TANNER          Maria_resume              6
8      GRACE PINKERTON          Grace_resume              6
9            AMY JONES            Amy_resume              4
11       DAPHNE WRIGHT         Daphne_resume              1
12  CATHERINE DRUMMOND            Cat_resume              5
13      MARIE ANDERSON          Marie_resume              2
14         DANA LOWELL           Dana_resume              6
15   PEYTON A. GARRETT         Peyton_resume              2
16        CARLA FOSTER          Carla_resume              1

Sorting data frame by matched skill score in descending order

In [133]:
df1 = c_score.sort_values(["Matched skill"], ascending=False) 
df1

                  Name Name of the text file  Matched skill
7         MARIA TANNER          Maria_resume              6
8      GRACE PINKERTON          Grace_resume              6
14         DANA LOWELL           Dana_resume              6
1        JOSH K. SCOTT           Josh_resume              5
12  CATHERINE DRUMMOND            Cat_resume              5
0     THOMAS B. SEEKER         Thomas_resume              4
9            AMY JONES            Amy_resume              4
2         SVETLANA KON            Kon_resume              2
13      MARIE ANDERSON          Marie_resume              2
15   PEYTON A. GARRETT         Peyton_resume              2
3       PURSA TANEEPAN          Pursa_resume              1
4       IGOR KORICANAC           Igor_resume              1
6    PAT SRISITTIDECH             Pat_resume              1
11       DAPHNE WRIGHT         Daphne_resume              1
16        CARLA FOSTER          Carla_resume              1

The canididates are ranked according to their skills and characteristics that most fit the job description.

## Final Result

Then, I select only top 5 candidates who have the most number of matched skills.

In [134]:
df2 = df1.head(5)
df2

                  Name Name of the text file  Matched skill
7         MARIA TANNER          Maria_resume              6
8      GRACE PINKERTON          Grace_resume              6
14         DANA LOWELL           Dana_resume              6
1        JOSH K. SCOTT           Josh_resume              5
12  CATHERINE DRUMMOND            Cat_resume              5

After the screening of 15 candidates in our system, these 5 candidates are most qualified for the interview. Now I have a list of the 5 most fit candidates in order of priority (the most fit first) with their most salient characteristics.

Finally, I will write a list of 5 most fit candidates in my data frame to a CSV file called ToInterview.csv

In [138]:
with open('ToInterview.csv', 'a') as file:
    df2.to_csv(file, mode='a', encoding='utf-8', index=False)

In [172]:
pd.read_csv("ToInterview.csv")

                 Name Name of the text file  Matched skill
0        MARIA TANNER          Maria_resume              6
1     GRACE PINKERTON          Grace_resume              6
2         DANA LOWELL           Dana_resume              6
3       JOSH K. SCOTT           Josh_resume              5
4  CATHERINE DRUMMOND            Cat_resume              5